MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256MU814/mcu.h
#define IPC23 IPC23
extern volatile uint16_t IPC23 __attribute__((__sfr__));
__extension__ typedef struct tagIPC23BITS {
  union {
    struct {
      uint16_t OC9IP:3;
      uint16_t :1;
      uint16_t IC9IP:3;
      uint16_t :1;
      uint16_t PWM1IP:3;
      uint16_t :1;
      uint16_t PWM2IP:3;
    };
    struct {
      uint16_t OC9IP0:1;
      uint16_t OC9IP1:1;
      uint16_t OC9IP2:1;
      uint16_t :1;
      uint16_t IC9IP0:1;
      uint16_t IC9IP1:1;
      uint16_t IC9IP2:1;
      uint16_t :1;
      uint16_t PWM1IP0:1;
      uint16_t PWM1IP1:1;
      uint16_t PWM1IP2:1;
      uint16_t :1;
      uint16_t PWM2IP0:1;
      uint16_t PWM2IP1:1;
      uint16_t PWM2IP2:1;
    };
  };
} IPC23BITS;
extern volatile IPC23BITS IPC23bits __attribute__((__sfr__));

#define IPC24 IPC24
extern volatile uint16_t IPC24 __attribute__((__sfr__));
__extension__ typedef struct tagIPC24BITS {
  union {
    struct {
      uint16_t PWM3IP:3;
      uint16_t :1;
      uint16_t PWM4IP:3;
      uint16_t :1;
      uint16_t PWM5IP:3;
      uint16_t :1;
      uint16_t PWM6IP:3;
    };
    struct {
      uint16_t PWM3IP0:1;
      uint16_t PWM3IP1:1;
      uint16_t PWM3IP2:1;
      uint16_t :1;
      uint16_t PWM4IP0:1;
      uint16_t PWM4IP1:1;
      uint16_t PWM4IP2:1;
      uint16_t :1;
      uint16_t PWM5IP0:1;
      uint16_t PWM5IP1:1;
      uint16_t PWM5IP2:1;
      uint16_t :1;
      uint16_t PWM6IP0:1;
      uint16_t PWM6IP1:1;
      uint16_t PWM6IP2:1;
    };
  };
} IPC24BITS;
extern volatile IPC24BITS IPC24bits __attribute__((__sfr__));

#define IPC25 IPC25
extern volatile uint16_t IPC25 __attribute__((__sfr__));
__extension__ typedef struct tagIPC25BITS {
  union {
    struct {
      uint16_t PWM7IP:3;
    };
    struct {
      uint16_t PWM7IP0:1;
      uint16_t PWM7IP1:1;
      uint16_t PWM7IP2:1;
    };
  };
} IPC25BITS;
extern volatile IPC25BITS IPC25bits __attribute__((__sfr__));

#define IPC29 IPC29
extern volatile uint16_t IPC29 __attribute__((__sfr__));
__extension__ typedef struct tagIPC29BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t DMA8IP:3;
      uint16_t :1;
      uint16_t DMA9IP:3;
    };
    struct {
      uint16_t :8;
      uint16_t DMA8IP0:1;
      uint16_t DMA8IP1:1;
      uint16_t DMA8IP2:1;
      uint16_t :1;
      uint16_t DMA9IP0:1;
      uint16_t DMA9IP1:1;
      uint16_t DMA9IP2:1;
    };
  };
} IPC29BITS;
extern volatile IPC29BITS IPC29bits __attribute__((__sfr__));

#define IPC30 IPC30
extern volatile uint16_t IPC30 __attribute__((__sfr__));
__extension__ typedef struct tagIPC30BITS {
  union {
    struct {
      uint16_t DMA10IP:3;
      uint16_t :1;
      uint16_t DMA11IP:3;
      uint16_t :1;
      uint16_t SPI4EIP:3;
      uint16_t :1;
      uint16_t SPI4IP:3;
    };
    struct {
      uint16_t DMA10IP0:1;
      uint16_t DMA10IP1:1;
      uint16_t DMA10IP2:1;
      uint16_t :1;
      uint16_t DMA11IP0:1;
      uint16_t DMA11IP1:1;
      uint16_t DMA11IP2:1;
      uint16_t :1;
      uint16_t SPI4EIP0:1;
      uint16_t SPI4EIP1:1;
      uint16_t SPI4EIP2:1;
      uint16_t :1;
      uint16_t SPI4IP0:1;
      uint16_t SPI4IP1:1;
      uint16_t SPI4IP2:1;
    };
  };
} IPC30BITS;
extern volatile IPC30BITS IPC30bits __attribute__((__sfr__));

#define IPC31 IPC31
extern volatile uint16_t IPC31 __attribute__((__sfr__));
__extension__ typedef struct tagIPC31BITS {
  union {
    struct {
      uint16_t OC10IP:3;
      uint16_t :1;
      uint16_t IC10IP:3;
      uint16_t :1;
      uint16_t OC11IP:3;
      uint16_t :1;
      uint16_t IC11IP:3;
    };
    struct {
      uint16_t OC10IP0:1;
      uint16_t OC10IP1:1;
      uint16_t OC10IP2:1;
      uint16_t :1;
      uint16_t IC10IP0:1;
      uint16_t IC10IP1:1;
      uint16_t IC10IP2:1;
      uint16_t :1;
      uint16_t OC11IP0:1;
      uint16_t OC11IP1:1;
      uint16_t OC11IP2:1;
      uint16_t :1;
      uint16_t IC11IP0:1;
      uint16_t IC11IP1:1;
      uint16_t IC11IP2:1;
    };
  };
} IPC31BITS;
extern volatile IPC31BITS IPC31bits __attribute__((__sfr__));

#define IPC32 IPC32
extern volatile uint16_t IPC32 __attribute__((__sfr__));
__extension__ typedef struct tagIPC32BITS {
  union {
    struct {
      uint16_t OC12IP:3;
      uint16_t :1;
      uint16_t IC12IP:3;
      uint16_t :1;
      uint16_t DMA12IP:3;
      uint16_t :1;
      uint16_t DMA13IP:3;
    };
    struct {
      uint16_t OC12IP0:1;
      uint16_t OC12IP1:1;
      uint16_t OC12IP2:1;
      uint16_t :1;
      uint16_t IC12IP0:1;
      uint16_t IC12IP1:1;
      uint16_t IC12IP2:1;
      uint16_t :1;
      uint16_t DMA12IP0:1;
      uint16_t DMA12IP1:1;
      uint16_t DMA12IP2:1;
      uint16_t :1;
      uint16_t DMA13IP0:1;
      uint16_t DMA13IP1:1;
      uint16_t DMA13IP2:1;
    };
  };
} IPC32BITS;
extern volatile IPC32BITS IPC32bits __attribute__((__sfr__));

#define IPC33 IPC33
extern volatile uint16_t IPC33 __attribute__((__sfr__));
__extension__ typedef struct tagIPC33BITS {
  union {
    struct {
      uint16_t DMA14IP:3;
      uint16_t :5;
      uint16_t OC13IP:3;
      uint16_t :1;
      uint16_t IC13IP:3;
    };
    struct {
      uint16_t DMA14IP0:1;
      uint16_t DMA14IP1:1;
      uint16_t DMA14IP2:1;
      uint16_t :5;
      uint16_t OC13IP0:1;
      uint16_t OC13IP1:1;
      uint16_t OC13IP2:1;
      uint16_t :1;
      uint16_t IC13IP0:1;
      uint16_t IC13IP1:1;
      uint16_t IC13IP2:1;
    };
  };
} IPC33BITS;
extern volatile IPC33BITS IPC33bits __attribute__((__sfr__));

#define IPC34 IPC34
extern volatile uint16_t IPC34 __attribute__((__sfr__));
__extension__ typedef struct tagIPC34BITS {
  union {
    struct {
      uint16_t OC14IP:3;
      uint16_t :1;
      uint16_t IC14IP:3;
      uint16_t :1;
      uint16_t OC15IP:3;
      uint16_t :1;
      uint16_t IC15IP:3;
    };
    struct {
      uint16_t OC14IP0:1;
      uint16_t OC14IP1:1;
      uint16_t OC14IP2:1;
      uint16_t :1;
      uint16_t IC14IP0:1;
      uint16_t IC14IP1:1;
      uint16_t IC14IP2:1;
      uint16_t :1;
      uint16_t OC15IP0:1;
      uint16_t OC15IP1:1;
      uint16_t OC15IP2:1;
      uint16_t :1;
      uint16_t IC15IP0:1;
      uint16_t IC15IP1:1;
      uint16_t IC15IP2:1;
    };
  };
} IPC34BITS;
extern volatile IPC34BITS IPC34bits __attribute__((__sfr__));

