MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256MU814/mcu.h
extern volatile DMA13CNTBITS DMA13CNTbits __attribute__((__sfr__));

#define DMA14CON DMA14CON
extern volatile uint16_t DMA14CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA14CONBITS {
  union {
    struct {
      uint16_t MODE:2;
      uint16_t :2;
      uint16_t AMODE:2;
      uint16_t :5;
      uint16_t NULLW:1;
      uint16_t HALF:1;
      uint16_t DIR:1;
      uint16_t SIZE:1;
      uint16_t CHEN:1;
    };
    struct {
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t :2;
      uint16_t AMODE0:1;
      uint16_t AMODE1:1;
    };
  };
} DMA14CONBITS;
extern volatile DMA14CONBITS DMA14CONbits __attribute__((__sfr__));

#define DMA14REQ DMA14REQ
extern volatile uint16_t DMA14REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA14REQBITS {
  union {
    struct {
      uint16_t IRQSEL:8;
      uint16_t :7;
      uint16_t FORCE:1;
    };
    struct {
      uint16_t IRQSEL0:1;
      uint16_t IRQSEL1:1;
      uint16_t IRQSEL2:1;
      uint16_t IRQSEL3:1;
      uint16_t IRQSEL4:1;
      uint16_t IRQSEL5:1;
      uint16_t IRQSEL6:1;
      uint16_t IRQSEL7:1;
    };
  };
} DMA14REQBITS;
extern volatile DMA14REQBITS DMA14REQbits __attribute__((__sfr__));

#define DMA14STAL DMA14STAL
extern volatile uint16_t DMA14STAL __attribute__((__sfr__));
#define DMA14STAH DMA14STAH
extern volatile uint16_t DMA14STAH __attribute__((__sfr__));
typedef struct tagDMA14STAHBITS {
  uint16_t STA:8;
} DMA14STAHBITS;
extern volatile DMA14STAHBITS DMA14STAHbits __attribute__((__sfr__));

#define DMA14STBL DMA14STBL
extern volatile uint16_t DMA14STBL __attribute__((__sfr__));
#define DMA14STBH DMA14STBH
extern volatile uint16_t DMA14STBH __attribute__((__sfr__));
typedef struct tagDMA14STBHBITS {
  uint16_t STB:8;
} DMA14STBHBITS;
extern volatile DMA14STBHBITS DMA14STBHbits __attribute__((__sfr__));

#define DMA14PAD DMA14PAD
extern volatile uint16_t DMA14PAD __attribute__((__sfr__));
#define DMA14CNT DMA14CNT
extern volatile uint16_t DMA14CNT __attribute__((__sfr__));
typedef struct tagDMA14CNTBITS {
  uint16_t CNT:14;
} DMA14CNTBITS;
extern volatile DMA14CNTBITS DMA14CNTbits __attribute__((__sfr__));

#define DMAPWC DMAPWC
extern volatile uint16_t DMAPWC __attribute__((__sfr__));
typedef struct tagDMAPWCBITS {
  uint16_t PWCOL0:1;
  uint16_t PWCOL1:1;
  uint16_t PWCOL2:1;
  uint16_t PWCOL3:1;
  uint16_t PWCOL4:1;
  uint16_t PWCOL5:1;
  uint16_t PWCOL6:1;
  uint16_t PWCOL7:1;
  uint16_t PWCOL8:1;
  uint16_t PWCOL9:1;
  uint16_t PWCOL10:1;
  uint16_t PWCOL11:1;
  uint16_t PWCOL12:1;
  uint16_t PWCOL13:1;
  uint16_t PWCOL14:1;
} DMAPWCBITS;
extern volatile DMAPWCBITS DMAPWCbits __attribute__((__sfr__));

#define DMARQC DMARQC
extern volatile uint16_t DMARQC __attribute__((__sfr__));
typedef struct tagDMARQCBITS {
  uint16_t RQCOL0:1;
  uint16_t RQCOL1:1;
  uint16_t RQCOL2:1;
  uint16_t RQCOL3:1;
  uint16_t RQCOL4:1;
  uint16_t RQCOL5:1;
  uint16_t RQCOL6:1;
  uint16_t RQCOL7:1;
  uint16_t RQCOL8:1;
  uint16_t RQCOL9:1;
  uint16_t RQCOL10:1;
  uint16_t RQCOL11:1;
  uint16_t RQCOL12:1;
  uint16_t RQCOL13:1;
  uint16_t RQCOL14:1;
} DMARQCBITS;
extern volatile DMARQCBITS DMARQCbits __attribute__((__sfr__));

#define DMAPPS DMAPPS
extern volatile uint16_t DMAPPS __attribute__((__sfr__));
typedef struct tagDMAPPSBITS {
  uint16_t PPST0:1;
  uint16_t PPST1:1;
  uint16_t PPST2:1;
  uint16_t PPST3:1;
  uint16_t PPST4:1;
  uint16_t PPST5:1;
  uint16_t PPST6:1;
  uint16_t PPST7:1;
  uint16_t PPST8:1;
  uint16_t PPST9:1;
  uint16_t PPST10:1;
  uint16_t PPST11:1;
  uint16_t PPST12:1;
  uint16_t PPST13:1;
  uint16_t PPST14:1;
} DMAPPSBITS;
extern volatile DMAPPSBITS DMAPPSbits __attribute__((__sfr__));

#define DMALCA DMALCA
extern volatile uint16_t DMALCA __attribute__((__sfr__));
__extension__ typedef struct tagDMALCABITS {
  union {
    struct {
      uint16_t LSTCH:4;
    };
    struct {
      uint16_t LSTCH0:1;
      uint16_t LSTCH1:1;
      uint16_t LSTCH2:1;
      uint16_t LSTCH3:1;
    };
  };
} DMALCABITS;
extern volatile DMALCABITS DMALCAbits __attribute__((__sfr__));

#define DSADRL DSADRL
extern volatile uint16_t DSADRL __attribute__((__sfr__));
#define DSADRH DSADRH
extern volatile uint16_t DSADRH __attribute__((__sfr__));
typedef struct tagDSADRHBITS {
  uint16_t DSADR:8;
} DSADRHBITS;
extern volatile DSADRHBITS DSADRHbits __attribute__((__sfr__));

#define PTCON PTCON
extern volatile uint16_t PTCON __attribute__((__sfr__));
__extension__ typedef struct tagPTCONBITS {
  union {
    struct {
      uint16_t SEVTPS:4;
      uint16_t SYNCSRC:3;
      uint16_t SYNCEN:1;
      uint16_t SYNCOEN:1;
      uint16_t SYNCPOL:1;
      uint16_t EIPU:1;
      uint16_t SEIEN:1;
      uint16_t SESTAT:1;
      uint16_t PTSIDL:1;
      uint16_t :1;
      uint16_t PTEN:1;
    };
    struct {
      uint16_t SEVTPS0:1;
      uint16_t SEVTPS1:1;
      uint16_t SEVTPS2:1;
      uint16_t SEVTPS3:1;
      uint16_t SYNCSRC0:1;
      uint16_t SYNCSRC1:1;
      uint16_t SYNCSRC2:1;
    };
  };
} PTCONBITS;
extern volatile PTCONBITS PTCONbits __attribute__((__sfr__));

#define PTCON2 PTCON2
extern volatile uint16_t PTCON2 __attribute__((__sfr__));
__extension__ typedef struct tagPTCON2BITS {
  union {
    struct {
      uint16_t PCLKDIV:3;
    };
    struct {
      uint16_t PCLKDIV0:1;
      uint16_t PCLKDIV1:1;
      uint16_t PCLKDIV2:1;
    };
  };
} PTCON2BITS;
extern volatile PTCON2BITS PTCON2bits __attribute__((__sfr__));

#define PTPER PTPER
extern volatile uint16_t PTPER __attribute__((__sfr__));
#define SEVTCMP SEVTCMP
extern volatile uint16_t SEVTCMP __attribute__((__sfr__));
typedef struct tagSEVTCMPBITS {
  uint16_t :3;
  uint16_t SEVTCMP:13;
} SEVTCMPBITS;
extern volatile SEVTCMPBITS SEVTCMPbits __attribute__((__sfr__));

#define MDC MDC
extern volatile uint16_t MDC __attribute__((__sfr__));
#define STCON STCON
extern volatile uint16_t STCON __attribute__((__sfr__));
__extension__ typedef struct tagSTCONBITS {
  union {
    struct {
      uint16_t SEVTPS:4;
      uint16_t SYNCSRC:3;
      uint16_t SYNCEN:1;
      uint16_t SYNCOEN:1;
      uint16_t SYNCPOL:1;
      uint16_t EIPU:1;
      uint16_t SEIEN:1;
      uint16_t SESTAT:1;
    };
    struct {
      uint16_t SEVTPS0:1;
      uint16_t SEVTPS1:1;
      uint16_t SEVTPS2:1;
      uint16_t SEVTPS3:1;
      uint16_t SYNCSRC0:1;
      uint16_t SYNCSRC1:1;
      uint16_t SYNCSRC2:1;
    };
  };
} STCONBITS;
extern volatile STCONBITS STCONbits __attribute__((__sfr__));

#define STCON2 STCON2
extern volatile uint16_t STCON2 __attribute__((__sfr__));
__extension__ typedef struct tagSTCON2BITS {
  union {
    struct {
      uint16_t PCLKDIV:3;
    };
    struct {
      uint16_t PCLKDIV0:1;
      uint16_t PCLKDIV1:1;
      uint16_t PCLKDIV2:1;
    };
  };
} STCON2BITS;
extern volatile STCON2BITS STCON2bits __attribute__((__sfr__));

#define STPER STPER
extern volatile uint16_t STPER __attribute__((__sfr__));
#define SSEVTCMP SSEVTCMP
extern volatile uint16_t SSEVTCMP __attribute__((__sfr__));
__extension__ typedef struct tagSSEVTCMPBITS {
  union {
    struct {
      uint16_t :3;
      uint16_t SSEVTCMP:13;
    };
    struct {
      uint16_t :3;
      uint16_t SSEVTCMP0:1;
      uint16_t SSEVTCMP1:1;
      uint16_t SSEVTCMP2:1;
      uint16_t SSEVTCMP3:1;
      uint16_t SSEVTCMP4:1;
      uint16_t SSEVTCMP5:1;
      uint16_t SSEVTCMP6:1;
      uint16_t SSEVTCMP7:1;
      uint16_t SSEVTCMP8:1;
      uint16_t SSEVTCMP9:1;
      uint16_t SSEVTCMP10:1;
      uint16_t SSEVTCMP11:1;
      uint16_t SSEVTCMP12:1;
    };
  };
} SSEVTCMPBITS;
extern volatile SSEVTCMPBITS SSEVTCMPbits __attribute__((__sfr__));

#define CHOP CHOP
extern volatile uint16_t CHOP __attribute__((__sfr__));
__extension__ typedef struct tagCHOPBITS {
  union {
    struct {
      uint16_t CHOPCLK:10;
      uint16_t :5;
      uint16_t CHPCLKEN:1;
    };
    struct {
      uint16_t CHOPCLK0:1;
      uint16_t CHOPCLK1:1;
      uint16_t CHOPCLK2:1;
      uint16_t CHOPCLK3:1;
      uint16_t CHOPCLK4:1;
      uint16_t CHOPCLK5:1;
      uint16_t CHOPCLK6:1;
      uint16_t CHOPCLK7:1;
      uint16_t CHOPCLK8:1;
      uint16_t CHOPCLK9:1;
    };
  };
} CHOPBITS;
extern volatile CHOPBITS CHOPbits __attribute__((__sfr__));

#define PWMCON1 PWMCON1
extern volatile uint16_t PWMCON1 __attribute__((__sfr__));
__extension__ typedef struct tagPWMCON1BITS {
  union {
    struct {
      uint16_t IUE:1;
      uint16_t XPRES:1;
      uint16_t CAM:1;
      uint16_t MTBS:1;
      uint16_t :1;
      uint16_t DTCP:1;
      uint16_t DTC:2;
      uint16_t MDCS:1;
      uint16_t ITB:1;
      uint16_t TRGIEN:1;
      uint16_t CLIEN:1;
      uint16_t FLTIEN:1;
      uint16_t TRGSTAT:1;
      uint16_t CLSTAT:1;
      uint16_t FLTSTAT:1;
    };
    struct {
      uint16_t :6;
      uint16_t DTC0:1;
      uint16_t DTC1:1;
    };
  };
} PWMCON1BITS;
