MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256MU814/mcu.h
#define _RPOR4_RP80R2_POSITION                   0x0000000A
#define _RPOR4_RP80R2_MASK                       0x00000400
#define _RPOR4_RP80R2_LENGTH                     0x00000001

#define _RPOR4_RP80R3_POSITION                   0x0000000B
#define _RPOR4_RP80R3_MASK                       0x00000800
#define _RPOR4_RP80R3_LENGTH                     0x00000001

#define _RPOR4_RP80R4_POSITION                   0x0000000C
#define _RPOR4_RP80R4_MASK                       0x00001000
#define _RPOR4_RP80R4_LENGTH                     0x00000001

#define _RPOR4_RP80R5_POSITION                   0x0000000D
#define _RPOR4_RP80R5_MASK                       0x00002000
#define _RPOR4_RP80R5_LENGTH                     0x00000001

#define _RPOR5_RP82R_POSITION                    0x00000000
#define _RPOR5_RP82R_MASK                        0x0000003F
#define _RPOR5_RP82R_LENGTH                      0x00000006

#define _RPOR5_RP84R_POSITION                    0x00000008
#define _RPOR5_RP84R_MASK                        0x00003F00
#define _RPOR5_RP84R_LENGTH                      0x00000006

#define _RPOR5_RP82R0_POSITION                   0x00000000
#define _RPOR5_RP82R0_MASK                       0x00000001
#define _RPOR5_RP82R0_LENGTH                     0x00000001

#define _RPOR5_RP82R1_POSITION                   0x00000001
#define _RPOR5_RP82R1_MASK                       0x00000002
#define _RPOR5_RP82R1_LENGTH                     0x00000001

#define _RPOR5_RP82R2_POSITION                   0x00000002
#define _RPOR5_RP82R2_MASK                       0x00000004
#define _RPOR5_RP82R2_LENGTH                     0x00000001

#define _RPOR5_RP82R3_POSITION                   0x00000003
#define _RPOR5_RP82R3_MASK                       0x00000008
#define _RPOR5_RP82R3_LENGTH                     0x00000001

#define _RPOR5_RP82R4_POSITION                   0x00000004
#define _RPOR5_RP82R4_MASK                       0x00000010
#define _RPOR5_RP82R4_LENGTH                     0x00000001

#define _RPOR5_RP82R5_POSITION                   0x00000005
#define _RPOR5_RP82R5_MASK                       0x00000020
#define _RPOR5_RP82R5_LENGTH                     0x00000001

#define _RPOR5_RP84R0_POSITION                   0x00000008
#define _RPOR5_RP84R0_MASK                       0x00000100
#define _RPOR5_RP84R0_LENGTH                     0x00000001

#define _RPOR5_RP84R1_POSITION                   0x00000009
#define _RPOR5_RP84R1_MASK                       0x00000200
#define _RPOR5_RP84R1_LENGTH                     0x00000001

#define _RPOR5_RP84R2_POSITION                   0x0000000A
#define _RPOR5_RP84R2_MASK                       0x00000400
#define _RPOR5_RP84R2_LENGTH                     0x00000001

#define _RPOR5_RP84R3_POSITION                   0x0000000B
#define _RPOR5_RP84R3_MASK                       0x00000800
#define _RPOR5_RP84R3_LENGTH                     0x00000001

#define _RPOR5_RP84R4_POSITION                   0x0000000C
#define _RPOR5_RP84R4_MASK                       0x00001000
#define _RPOR5_RP84R4_LENGTH                     0x00000001

#define _RPOR5_RP84R5_POSITION                   0x0000000D
#define _RPOR5_RP84R5_MASK                       0x00002000
#define _RPOR5_RP84R5_LENGTH                     0x00000001

#define _RPOR6_RP85R_POSITION                    0x00000000
#define _RPOR6_RP85R_MASK                        0x0000003F
#define _RPOR6_RP85R_LENGTH                      0x00000006

#define _RPOR6_RP87R_POSITION                    0x00000008
#define _RPOR6_RP87R_MASK                        0x00003F00
#define _RPOR6_RP87R_LENGTH                      0x00000006

#define _RPOR6_RP85R0_POSITION                   0x00000000
#define _RPOR6_RP85R0_MASK                       0x00000001
#define _RPOR6_RP85R0_LENGTH                     0x00000001

#define _RPOR6_RP85R1_POSITION                   0x00000001
#define _RPOR6_RP85R1_MASK                       0x00000002
#define _RPOR6_RP85R1_LENGTH                     0x00000001

#define _RPOR6_RP85R2_POSITION                   0x00000002
#define _RPOR6_RP85R2_MASK                       0x00000004
#define _RPOR6_RP85R2_LENGTH                     0x00000001

#define _RPOR6_RP85R3_POSITION                   0x00000003
#define _RPOR6_RP85R3_MASK                       0x00000008
#define _RPOR6_RP85R3_LENGTH                     0x00000001

#define _RPOR6_RP85R4_POSITION                   0x00000004
#define _RPOR6_RP85R4_MASK                       0x00000010
#define _RPOR6_RP85R4_LENGTH                     0x00000001

#define _RPOR6_RP85R5_POSITION                   0x00000005
#define _RPOR6_RP85R5_MASK                       0x00000020
#define _RPOR6_RP85R5_LENGTH                     0x00000001

#define _RPOR6_RP87R0_POSITION                   0x00000008
#define _RPOR6_RP87R0_MASK                       0x00000100
#define _RPOR6_RP87R0_LENGTH                     0x00000001

#define _RPOR6_RP87R1_POSITION                   0x00000009
#define _RPOR6_RP87R1_MASK                       0x00000200
#define _RPOR6_RP87R1_LENGTH                     0x00000001

#define _RPOR6_RP87R2_POSITION                   0x0000000A
#define _RPOR6_RP87R2_MASK                       0x00000400
#define _RPOR6_RP87R2_LENGTH                     0x00000001

#define _RPOR6_RP87R3_POSITION                   0x0000000B
#define _RPOR6_RP87R3_MASK                       0x00000800
#define _RPOR6_RP87R3_LENGTH                     0x00000001

#define _RPOR6_RP87R4_POSITION                   0x0000000C
#define _RPOR6_RP87R4_MASK                       0x00001000
#define _RPOR6_RP87R4_LENGTH                     0x00000001

#define _RPOR6_RP87R5_POSITION                   0x0000000D
#define _RPOR6_RP87R5_MASK                       0x00002000
#define _RPOR6_RP87R5_LENGTH                     0x00000001

#define _RPOR7_RP96R_POSITION                    0x00000000
#define _RPOR7_RP96R_MASK                        0x0000003F
#define _RPOR7_RP96R_LENGTH                      0x00000006

#define _RPOR7_RP97R_POSITION                    0x00000008
#define _RPOR7_RP97R_MASK                        0x00003F00
#define _RPOR7_RP97R_LENGTH                      0x00000006

#define _RPOR7_RP96R0_POSITION                   0x00000000
#define _RPOR7_RP96R0_MASK                       0x00000001
#define _RPOR7_RP96R0_LENGTH                     0x00000001

#define _RPOR7_RP96R1_POSITION                   0x00000001
#define _RPOR7_RP96R1_MASK                       0x00000002
#define _RPOR7_RP96R1_LENGTH                     0x00000001

