MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256MU814/mcu.h
#define _RPINR36_IC15R5_POSITION                 0x00000005
#define _RPINR36_IC15R5_MASK                     0x00000020
#define _RPINR36_IC15R5_LENGTH                   0x00000001

#define _RPINR36_IC15R6_POSITION                 0x00000006
#define _RPINR36_IC15R6_MASK                     0x00000040
#define _RPINR36_IC15R6_LENGTH                   0x00000001

#define _RPINR36_IC16R0_POSITION                 0x00000008
#define _RPINR36_IC16R0_MASK                     0x00000100
#define _RPINR36_IC16R0_LENGTH                   0x00000001

#define _RPINR36_IC16R1_POSITION                 0x00000009
#define _RPINR36_IC16R1_MASK                     0x00000200
#define _RPINR36_IC16R1_LENGTH                   0x00000001

#define _RPINR36_IC16R2_POSITION                 0x0000000A
#define _RPINR36_IC16R2_MASK                     0x00000400
#define _RPINR36_IC16R2_LENGTH                   0x00000001

#define _RPINR36_IC16R3_POSITION                 0x0000000B
#define _RPINR36_IC16R3_MASK                     0x00000800
#define _RPINR36_IC16R3_LENGTH                   0x00000001

#define _RPINR36_IC16R4_POSITION                 0x0000000C
#define _RPINR36_IC16R4_MASK                     0x00001000
#define _RPINR36_IC16R4_LENGTH                   0x00000001

#define _RPINR36_IC16R5_POSITION                 0x0000000D
#define _RPINR36_IC16R5_MASK                     0x00002000
#define _RPINR36_IC16R5_LENGTH                   0x00000001

#define _RPINR36_IC16R6_POSITION                 0x0000000E
#define _RPINR36_IC16R6_MASK                     0x00004000
#define _RPINR36_IC16R6_LENGTH                   0x00000001

#define _RPINR37_OCFCR_POSITION                  0x00000000
#define _RPINR37_OCFCR_MASK                      0x0000007F
#define _RPINR37_OCFCR_LENGTH                    0x00000007

#define _RPINR37_SYNCI1R_POSITION                0x00000008
#define _RPINR37_SYNCI1R_MASK                    0x00007F00
#define _RPINR37_SYNCI1R_LENGTH                  0x00000007

#define _RPINR37_OCFCR0_POSITION                 0x00000000
#define _RPINR37_OCFCR0_MASK                     0x00000001
#define _RPINR37_OCFCR0_LENGTH                   0x00000001

#define _RPINR37_OCFCR1_POSITION                 0x00000001
#define _RPINR37_OCFCR1_MASK                     0x00000002
#define _RPINR37_OCFCR1_LENGTH                   0x00000001

#define _RPINR37_OCFCR2_POSITION                 0x00000002
#define _RPINR37_OCFCR2_MASK                     0x00000004
#define _RPINR37_OCFCR2_LENGTH                   0x00000001

#define _RPINR37_OCFCR3_POSITION                 0x00000003
#define _RPINR37_OCFCR3_MASK                     0x00000008
#define _RPINR37_OCFCR3_LENGTH                   0x00000001

#define _RPINR37_OCFCR4_POSITION                 0x00000004
#define _RPINR37_OCFCR4_MASK                     0x00000010
#define _RPINR37_OCFCR4_LENGTH                   0x00000001

#define _RPINR37_OCFCR5_POSITION                 0x00000005
#define _RPINR37_OCFCR5_MASK                     0x00000020
#define _RPINR37_OCFCR5_LENGTH                   0x00000001

#define _RPINR37_OCFCR6_POSITION                 0x00000006
#define _RPINR37_OCFCR6_MASK                     0x00000040
#define _RPINR37_OCFCR6_LENGTH                   0x00000001

#define _RPINR37_SYNCI1R0_POSITION               0x00000008
#define _RPINR37_SYNCI1R0_MASK                   0x00000100
#define _RPINR37_SYNCI1R0_LENGTH                 0x00000001

#define _RPINR37_SYNCI1R1_POSITION               0x00000009
#define _RPINR37_SYNCI1R1_MASK                   0x00000200
#define _RPINR37_SYNCI1R1_LENGTH                 0x00000001

#define _RPINR37_SYNCI1R2_POSITION               0x0000000A
#define _RPINR37_SYNCI1R2_MASK                   0x00000400
#define _RPINR37_SYNCI1R2_LENGTH                 0x00000001

#define _RPINR37_SYNCI1R3_POSITION               0x0000000B
#define _RPINR37_SYNCI1R3_MASK                   0x00000800
#define _RPINR37_SYNCI1R3_LENGTH                 0x00000001

#define _RPINR37_SYNCI1R4_POSITION               0x0000000C
#define _RPINR37_SYNCI1R4_MASK                   0x00001000
#define _RPINR37_SYNCI1R4_LENGTH                 0x00000001

#define _RPINR37_SYNCI1R5_POSITION               0x0000000D
#define _RPINR37_SYNCI1R5_MASK                   0x00002000
#define _RPINR37_SYNCI1R5_LENGTH                 0x00000001

#define _RPINR37_SYNCI1R6_POSITION               0x0000000E
#define _RPINR37_SYNCI1R6_MASK                   0x00004000
#define _RPINR37_SYNCI1R6_LENGTH                 0x00000001

#define _RPINR38_SYNCI2R_POSITION                0x00000000
#define _RPINR38_SYNCI2R_MASK                    0x0000007F
#define _RPINR38_SYNCI2R_LENGTH                  0x00000007

#define _RPINR38_DTCMP1R_POSITION                0x00000008
#define _RPINR38_DTCMP1R_MASK                    0x00007F00
#define _RPINR38_DTCMP1R_LENGTH                  0x00000007

#define _RPINR38_SYNCI2R0_POSITION               0x00000000
#define _RPINR38_SYNCI2R0_MASK                   0x00000001
#define _RPINR38_SYNCI2R0_LENGTH                 0x00000001

#define _RPINR38_SYNCI2R1_POSITION               0x00000001
#define _RPINR38_SYNCI2R1_MASK                   0x00000002
#define _RPINR38_SYNCI2R1_LENGTH                 0x00000001

#define _RPINR38_SYNCI2R2_POSITION               0x00000002
#define _RPINR38_SYNCI2R2_MASK                   0x00000004
#define _RPINR38_SYNCI2R2_LENGTH                 0x00000001

#define _RPINR38_SYNCI2R3_POSITION               0x00000003
#define _RPINR38_SYNCI2R3_MASK                   0x00000008
#define _RPINR38_SYNCI2R3_LENGTH                 0x00000001

#define _RPINR38_SYNCI2R4_POSITION               0x00000004
#define _RPINR38_SYNCI2R4_MASK                   0x00000010
#define _RPINR38_SYNCI2R4_LENGTH                 0x00000001

#define _RPINR38_SYNCI2R5_POSITION               0x00000005
#define _RPINR38_SYNCI2R5_MASK                   0x00000020
#define _RPINR38_SYNCI2R5_LENGTH                 0x00000001

#define _RPINR38_SYNCI2R6_POSITION               0x00000006
#define _RPINR38_SYNCI2R6_MASK                   0x00000040
#define _RPINR38_SYNCI2R6_LENGTH                 0x00000001

#define _RPINR38_DTCMP1R0_POSITION               0x00000008
#define _RPINR38_DTCMP1R0_MASK                   0x00000100
#define _RPINR38_DTCMP1R0_LENGTH                 0x00000001

