MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256MU814/mcu.h
#define _IPC24_PWM3IP0_POSITION                  0x00000000
#define _IPC24_PWM3IP0_MASK                      0x00000001
#define _IPC24_PWM3IP0_LENGTH                    0x00000001

#define _IPC24_PWM3IP1_POSITION                  0x00000001
#define _IPC24_PWM3IP1_MASK                      0x00000002
#define _IPC24_PWM3IP1_LENGTH                    0x00000001

#define _IPC24_PWM3IP2_POSITION                  0x00000002
#define _IPC24_PWM3IP2_MASK                      0x00000004
#define _IPC24_PWM3IP2_LENGTH                    0x00000001

#define _IPC24_PWM4IP0_POSITION                  0x00000004
#define _IPC24_PWM4IP0_MASK                      0x00000010
#define _IPC24_PWM4IP0_LENGTH                    0x00000001

#define _IPC24_PWM4IP1_POSITION                  0x00000005
#define _IPC24_PWM4IP1_MASK                      0x00000020
#define _IPC24_PWM4IP1_LENGTH                    0x00000001

#define _IPC24_PWM4IP2_POSITION                  0x00000006
#define _IPC24_PWM4IP2_MASK                      0x00000040
#define _IPC24_PWM4IP2_LENGTH                    0x00000001

#define _IPC24_PWM5IP0_POSITION                  0x00000008
#define _IPC24_PWM5IP0_MASK                      0x00000100
#define _IPC24_PWM5IP0_LENGTH                    0x00000001

#define _IPC24_PWM5IP1_POSITION                  0x00000009
#define _IPC24_PWM5IP1_MASK                      0x00000200
#define _IPC24_PWM5IP1_LENGTH                    0x00000001

#define _IPC24_PWM5IP2_POSITION                  0x0000000A
#define _IPC24_PWM5IP2_MASK                      0x00000400
#define _IPC24_PWM5IP2_LENGTH                    0x00000001

#define _IPC24_PWM6IP0_POSITION                  0x0000000C
#define _IPC24_PWM6IP0_MASK                      0x00001000
#define _IPC24_PWM6IP0_LENGTH                    0x00000001

#define _IPC24_PWM6IP1_POSITION                  0x0000000D
#define _IPC24_PWM6IP1_MASK                      0x00002000
#define _IPC24_PWM6IP1_LENGTH                    0x00000001

#define _IPC24_PWM6IP2_POSITION                  0x0000000E
#define _IPC24_PWM6IP2_MASK                      0x00004000
#define _IPC24_PWM6IP2_LENGTH                    0x00000001

#define _IPC25_PWM7IP_POSITION                   0x00000000
#define _IPC25_PWM7IP_MASK                       0x00000007
#define _IPC25_PWM7IP_LENGTH                     0x00000003

#define _IPC25_PWM7IP0_POSITION                  0x00000000
#define _IPC25_PWM7IP0_MASK                      0x00000001
#define _IPC25_PWM7IP0_LENGTH                    0x00000001

#define _IPC25_PWM7IP1_POSITION                  0x00000001
#define _IPC25_PWM7IP1_MASK                      0x00000002
#define _IPC25_PWM7IP1_LENGTH                    0x00000001

#define _IPC25_PWM7IP2_POSITION                  0x00000002
#define _IPC25_PWM7IP2_MASK                      0x00000004
#define _IPC25_PWM7IP2_LENGTH                    0x00000001

#define _IPC29_DMA8IP_POSITION                   0x00000008
#define _IPC29_DMA8IP_MASK                       0x00000700
#define _IPC29_DMA8IP_LENGTH                     0x00000003

#define _IPC29_DMA9IP_POSITION                   0x0000000C
#define _IPC29_DMA9IP_MASK                       0x00007000
#define _IPC29_DMA9IP_LENGTH                     0x00000003

#define _IPC29_DMA8IP0_POSITION                  0x00000008
#define _IPC29_DMA8IP0_MASK                      0x00000100
#define _IPC29_DMA8IP0_LENGTH                    0x00000001

#define _IPC29_DMA8IP1_POSITION                  0x00000009
#define _IPC29_DMA8IP1_MASK                      0x00000200
#define _IPC29_DMA8IP1_LENGTH                    0x00000001

#define _IPC29_DMA8IP2_POSITION                  0x0000000A
#define _IPC29_DMA8IP2_MASK                      0x00000400
#define _IPC29_DMA8IP2_LENGTH                    0x00000001

#define _IPC29_DMA9IP0_POSITION                  0x0000000C
#define _IPC29_DMA9IP0_MASK                      0x00001000
#define _IPC29_DMA9IP0_LENGTH                    0x00000001

#define _IPC29_DMA9IP1_POSITION                  0x0000000D
#define _IPC29_DMA9IP1_MASK                      0x00002000
#define _IPC29_DMA9IP1_LENGTH                    0x00000001

#define _IPC29_DMA9IP2_POSITION                  0x0000000E
#define _IPC29_DMA9IP2_MASK                      0x00004000
#define _IPC29_DMA9IP2_LENGTH                    0x00000001

#define _IPC30_DMA10IP_POSITION                  0x00000000
#define _IPC30_DMA10IP_MASK                      0x00000007
#define _IPC30_DMA10IP_LENGTH                    0x00000003

#define _IPC30_DMA11IP_POSITION                  0x00000004
#define _IPC30_DMA11IP_MASK                      0x00000070
#define _IPC30_DMA11IP_LENGTH                    0x00000003

#define _IPC30_SPI4EIP_POSITION                  0x00000008
#define _IPC30_SPI4EIP_MASK                      0x00000700
#define _IPC30_SPI4EIP_LENGTH                    0x00000003

#define _IPC30_SPI4IP_POSITION                   0x0000000C
#define _IPC30_SPI4IP_MASK                       0x00007000
#define _IPC30_SPI4IP_LENGTH                     0x00000003

#define _IPC30_DMA10IP0_POSITION                 0x00000000
#define _IPC30_DMA10IP0_MASK                     0x00000001
#define _IPC30_DMA10IP0_LENGTH                   0x00000001

#define _IPC30_DMA10IP1_POSITION                 0x00000001
#define _IPC30_DMA10IP1_MASK                     0x00000002
#define _IPC30_DMA10IP1_LENGTH                   0x00000001

#define _IPC30_DMA10IP2_POSITION                 0x00000002
#define _IPC30_DMA10IP2_MASK                     0x00000004
#define _IPC30_DMA10IP2_LENGTH                   0x00000001

#define _IPC30_DMA11IP0_POSITION                 0x00000004
#define _IPC30_DMA11IP0_MASK                     0x00000010
#define _IPC30_DMA11IP0_LENGTH                   0x00000001

#define _IPC30_DMA11IP1_POSITION                 0x00000005
#define _IPC30_DMA11IP1_MASK                     0x00000020
#define _IPC30_DMA11IP1_LENGTH                   0x00000001

#define _IPC30_DMA11IP2_POSITION                 0x00000006
#define _IPC30_DMA11IP2_MASK                     0x00000040
#define _IPC30_DMA11IP2_LENGTH                   0x00000001

#define _IPC30_SPI4EIP0_POSITION                 0x00000008
#define _IPC30_SPI4EIP0_MASK                     0x00000100
#define _IPC30_SPI4EIP0_LENGTH                   0x00000001

#define _IPC30_SPI4EIP1_POSITION                 0x00000009
#define _IPC30_SPI4EIP1_MASK                     0x00000200
#define _IPC30_SPI4EIP1_LENGTH                   0x00000001

#define _IPC30_SPI4EIP2_POSITION                 0x0000000A
#define _IPC30_SPI4EIP2_MASK                     0x00000400
#define _IPC30_SPI4EIP2_LENGTH                   0x00000001

#define _IPC30_SPI4IP0_POSITION                  0x0000000C
#define _IPC30_SPI4IP0_MASK                      0x00001000
#define _IPC30_SPI4IP0_LENGTH                    0x00000001

#define _IPC30_SPI4IP1_POSITION                  0x0000000D
#define _IPC30_SPI4IP1_MASK                      0x00002000
#define _IPC30_SPI4IP1_LENGTH                    0x00000001

#define _IPC30_SPI4IP2_POSITION                  0x0000000E
#define _IPC30_SPI4IP2_MASK                      0x00004000
#define _IPC30_SPI4IP2_LENGTH                    0x00000001

#define _IPC31_OC10IP_POSITION                   0x00000000
#define _IPC31_OC10IP_MASK                       0x00000007
#define _IPC31_OC10IP_LENGTH                     0x00000003

#define _IPC31_IC10IP_POSITION                   0x00000004
#define _IPC31_IC10IP_MASK                       0x00000070
#define _IPC31_IC10IP_LENGTH                     0x00000003

#define _IPC31_OC11IP_POSITION                   0x00000008
#define _IPC31_OC11IP_MASK                       0x00000700
#define _IPC31_OC11IP_LENGTH                     0x00000003

#define _IPC31_IC11IP_POSITION                   0x0000000C
#define _IPC31_IC11IP_MASK                       0x00007000
#define _IPC31_IC11IP_LENGTH                     0x00000003

