MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256MU814/mcu.h
#define _LEBDLY7_LEB0_POSITION                   0x00000003
#define _LEBDLY7_LEB0_MASK                       0x00000008
#define _LEBDLY7_LEB0_LENGTH                     0x00000001

#define _LEBDLY7_LEB1_POSITION                   0x00000004
#define _LEBDLY7_LEB1_MASK                       0x00000010
#define _LEBDLY7_LEB1_LENGTH                     0x00000001

#define _LEBDLY7_LEB2_POSITION                   0x00000005
#define _LEBDLY7_LEB2_MASK                       0x00000020
#define _LEBDLY7_LEB2_LENGTH                     0x00000001

#define _LEBDLY7_LEB3_POSITION                   0x00000006
#define _LEBDLY7_LEB3_MASK                       0x00000040
#define _LEBDLY7_LEB3_LENGTH                     0x00000001

#define _LEBDLY7_LEB4_POSITION                   0x00000007
#define _LEBDLY7_LEB4_MASK                       0x00000080
#define _LEBDLY7_LEB4_LENGTH                     0x00000001

#define _LEBDLY7_LEB5_POSITION                   0x00000008
#define _LEBDLY7_LEB5_MASK                       0x00000100
#define _LEBDLY7_LEB5_LENGTH                     0x00000001

#define _LEBDLY7_LEB6_POSITION                   0x00000009
#define _LEBDLY7_LEB6_MASK                       0x00000200
#define _LEBDLY7_LEB6_LENGTH                     0x00000001

#define _LEBDLY7_LEB7_POSITION                   0x0000000A
#define _LEBDLY7_LEB7_MASK                       0x00000400
#define _LEBDLY7_LEB7_LENGTH                     0x00000001

#define _LEBDLY7_LEB8_POSITION                   0x0000000B
#define _LEBDLY7_LEB8_MASK                       0x00000800
#define _LEBDLY7_LEB8_LENGTH                     0x00000001

#define _AUXCON7_CHOPLEN_POSITION                0x00000000
#define _AUXCON7_CHOPLEN_MASK                    0x00000001
#define _AUXCON7_CHOPLEN_LENGTH                  0x00000001

#define _AUXCON7_CHOPHEN_POSITION                0x00000001
#define _AUXCON7_CHOPHEN_MASK                    0x00000002
#define _AUXCON7_CHOPHEN_LENGTH                  0x00000001

#define _AUXCON7_CHOPSEL_POSITION                0x00000002
#define _AUXCON7_CHOPSEL_MASK                    0x0000003C
#define _AUXCON7_CHOPSEL_LENGTH                  0x00000004

#define _AUXCON7_BLANKSEL_POSITION               0x00000008
#define _AUXCON7_BLANKSEL_MASK                   0x00000F00
#define _AUXCON7_BLANKSEL_LENGTH                 0x00000004

#define _AUXCON7_CHOPSEL0_POSITION               0x00000002
#define _AUXCON7_CHOPSEL0_MASK                   0x00000004
#define _AUXCON7_CHOPSEL0_LENGTH                 0x00000001

#define _AUXCON7_CHOPSEL1_POSITION               0x00000003
#define _AUXCON7_CHOPSEL1_MASK                   0x00000008
#define _AUXCON7_CHOPSEL1_LENGTH                 0x00000001

#define _AUXCON7_CHOPSEL2_POSITION               0x00000004
#define _AUXCON7_CHOPSEL2_MASK                   0x00000010
#define _AUXCON7_CHOPSEL2_LENGTH                 0x00000001

#define _AUXCON7_CHOPSEL3_POSITION               0x00000005
#define _AUXCON7_CHOPSEL3_MASK                   0x00000020
#define _AUXCON7_CHOPSEL3_LENGTH                 0x00000001

#define _AUXCON7_BLANKSEL0_POSITION              0x00000008
#define _AUXCON7_BLANKSEL0_MASK                  0x00000100
#define _AUXCON7_BLANKSEL0_LENGTH                0x00000001

#define _AUXCON7_BLANKSEL1_POSITION              0x00000009
#define _AUXCON7_BLANKSEL1_MASK                  0x00000200
#define _AUXCON7_BLANKSEL1_LENGTH                0x00000001

#define _AUXCON7_BLANKSEL2_POSITION              0x0000000A
#define _AUXCON7_BLANKSEL2_MASK                  0x00000400
#define _AUXCON7_BLANKSEL2_LENGTH                0x00000001

#define _AUXCON7_BLANKSEL3_POSITION              0x0000000B
#define _AUXCON7_BLANKSEL3_MASK                  0x00000800
#define _AUXCON7_BLANKSEL3_LENGTH                0x00000001

#define _TRISA_TRISA0_POSITION                   0x00000000
#define _TRISA_TRISA0_MASK                       0x00000001
#define _TRISA_TRISA0_LENGTH                     0x00000001

#define _TRISA_TRISA1_POSITION                   0x00000001
#define _TRISA_TRISA1_MASK                       0x00000002
#define _TRISA_TRISA1_LENGTH                     0x00000001

#define _TRISA_TRISA2_POSITION                   0x00000002
#define _TRISA_TRISA2_MASK                       0x00000004
#define _TRISA_TRISA2_LENGTH                     0x00000001

#define _TRISA_TRISA3_POSITION                   0x00000003
#define _TRISA_TRISA3_MASK                       0x00000008
#define _TRISA_TRISA3_LENGTH                     0x00000001

#define _TRISA_TRISA4_POSITION                   0x00000004
#define _TRISA_TRISA4_MASK                       0x00000010
#define _TRISA_TRISA4_LENGTH                     0x00000001

#define _TRISA_TRISA5_POSITION                   0x00000005
#define _TRISA_TRISA5_MASK                       0x00000020
#define _TRISA_TRISA5_LENGTH                     0x00000001

#define _TRISA_TRISA6_POSITION                   0x00000006
#define _TRISA_TRISA6_MASK                       0x00000040
#define _TRISA_TRISA6_LENGTH                     0x00000001

#define _TRISA_TRISA7_POSITION                   0x00000007
#define _TRISA_TRISA7_MASK                       0x00000080
#define _TRISA_TRISA7_LENGTH                     0x00000001

#define _TRISA_TRISA9_POSITION                   0x00000009
#define _TRISA_TRISA9_MASK                       0x00000200
#define _TRISA_TRISA9_LENGTH                     0x00000001

#define _TRISA_TRISA10_POSITION                  0x0000000A
#define _TRISA_TRISA10_MASK                      0x00000400
#define _TRISA_TRISA10_LENGTH                    0x00000001

#define _TRISA_TRISA14_POSITION                  0x0000000E
#define _TRISA_TRISA14_MASK                      0x00004000
#define _TRISA_TRISA14_LENGTH                    0x00000001

#define _TRISA_TRISA15_POSITION                  0x0000000F
#define _TRISA_TRISA15_MASK                      0x00008000
#define _TRISA_TRISA15_LENGTH                    0x00000001

#define _PORTA_RA0_POSITION                      0x00000000
#define _PORTA_RA0_MASK                          0x00000001
#define _PORTA_RA0_LENGTH                        0x00000001

#define _PORTA_RA1_POSITION                      0x00000001
#define _PORTA_RA1_MASK                          0x00000002
#define _PORTA_RA1_LENGTH                        0x00000001

#define _PORTA_RA2_POSITION                      0x00000002
#define _PORTA_RA2_MASK                          0x00000004
#define _PORTA_RA2_LENGTH                        0x00000001

#define _PORTA_RA3_POSITION                      0x00000003
#define _PORTA_RA3_MASK                          0x00000008
#define _PORTA_RA3_LENGTH                        0x00000001

#define _PORTA_RA4_POSITION                      0x00000004
#define _PORTA_RA4_MASK                          0x00000010
#define _PORTA_RA4_LENGTH                        0x00000001

#define _PORTA_RA5_POSITION                      0x00000005
#define _PORTA_RA5_MASK                          0x00000020
#define _PORTA_RA5_LENGTH                        0x00000001

