MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256MU814/mcu.h
#define _LATJ_LATJ8_POSITION                     0x00000008
#define _LATJ_LATJ8_MASK                         0x00000100
#define _LATJ_LATJ8_LENGTH                       0x00000001

#define _LATJ_LATJ9_POSITION                     0x00000009
#define _LATJ_LATJ9_MASK                         0x00000200
#define _LATJ_LATJ9_LENGTH                       0x00000001

#define _LATJ_LATJ10_POSITION                    0x0000000A
#define _LATJ_LATJ10_MASK                        0x00000400
#define _LATJ_LATJ10_LENGTH                      0x00000001

#define _LATJ_LATJ11_POSITION                    0x0000000B
#define _LATJ_LATJ11_MASK                        0x00000800
#define _LATJ_LATJ11_LENGTH                      0x00000001

#define _LATJ_LATJ12_POSITION                    0x0000000C
#define _LATJ_LATJ12_MASK                        0x00001000
#define _LATJ_LATJ12_LENGTH                      0x00000001

#define _LATJ_LATJ13_POSITION                    0x0000000D
#define _LATJ_LATJ13_MASK                        0x00002000
#define _LATJ_LATJ13_LENGTH                      0x00000001

#define _LATJ_LATJ14_POSITION                    0x0000000E
#define _LATJ_LATJ14_MASK                        0x00004000
#define _LATJ_LATJ14_LENGTH                      0x00000001

#define _LATJ_LATJ15_POSITION                    0x0000000F
#define _LATJ_LATJ15_MASK                        0x00008000
#define _LATJ_LATJ15_LENGTH                      0x00000001

#define _ODCJ_ODCJ0_POSITION                     0x00000000
#define _ODCJ_ODCJ0_MASK                         0x00000001
#define _ODCJ_ODCJ0_LENGTH                       0x00000001

#define _ODCJ_ODCJ1_POSITION                     0x00000001
#define _ODCJ_ODCJ1_MASK                         0x00000002
#define _ODCJ_ODCJ1_LENGTH                       0x00000001

#define _ODCJ_ODCJ2_POSITION                     0x00000002
#define _ODCJ_ODCJ2_MASK                         0x00000004
#define _ODCJ_ODCJ2_LENGTH                       0x00000001

#define _ODCJ_ODCJ3_POSITION                     0x00000003
#define _ODCJ_ODCJ3_MASK                         0x00000008
#define _ODCJ_ODCJ3_LENGTH                       0x00000001

#define _ODCJ_ODCJ4_POSITION                     0x00000004
#define _ODCJ_ODCJ4_MASK                         0x00000010
#define _ODCJ_ODCJ4_LENGTH                       0x00000001

#define _ODCJ_ODCJ5_POSITION                     0x00000005
#define _ODCJ_ODCJ5_MASK                         0x00000020
#define _ODCJ_ODCJ5_LENGTH                       0x00000001

#define _ODCJ_ODCJ6_POSITION                     0x00000006
#define _ODCJ_ODCJ6_MASK                         0x00000040
#define _ODCJ_ODCJ6_LENGTH                       0x00000001

#define _ODCJ_ODCJ7_POSITION                     0x00000007
#define _ODCJ_ODCJ7_MASK                         0x00000080
#define _ODCJ_ODCJ7_LENGTH                       0x00000001

#define _ODCJ_ODCJ8_POSITION                     0x00000008
#define _ODCJ_ODCJ8_MASK                         0x00000100
#define _ODCJ_ODCJ8_LENGTH                       0x00000001

#define _ODCJ_ODCJ9_POSITION                     0x00000009
#define _ODCJ_ODCJ9_MASK                         0x00000200
#define _ODCJ_ODCJ9_LENGTH                       0x00000001

#define _ODCJ_ODCJ10_POSITION                    0x0000000A
#define _ODCJ_ODCJ10_MASK                        0x00000400
#define _ODCJ_ODCJ10_LENGTH                      0x00000001

#define _ODCJ_ODCJ11_POSITION                    0x0000000B
#define _ODCJ_ODCJ11_MASK                        0x00000800
#define _ODCJ_ODCJ11_LENGTH                      0x00000001

#define _ODCJ_ODCJ12_POSITION                    0x0000000C
#define _ODCJ_ODCJ12_MASK                        0x00001000
#define _ODCJ_ODCJ12_LENGTH                      0x00000001

#define _ODCJ_ODCJ13_POSITION                    0x0000000D
#define _ODCJ_ODCJ13_MASK                        0x00002000
#define _ODCJ_ODCJ13_LENGTH                      0x00000001

#define _ODCJ_ODCJ14_POSITION                    0x0000000E
#define _ODCJ_ODCJ14_MASK                        0x00004000
#define _ODCJ_ODCJ14_LENGTH                      0x00000001

#define _ODCJ_ODCJ15_POSITION                    0x0000000F
#define _ODCJ_ODCJ15_MASK                        0x00008000
#define _ODCJ_ODCJ15_LENGTH                      0x00000001

#define _CNENJ_CNIEJ0_POSITION                   0x00000000
#define _CNENJ_CNIEJ0_MASK                       0x00000001
#define _CNENJ_CNIEJ0_LENGTH                     0x00000001

#define _CNENJ_CNIEJ1_POSITION                   0x00000001
#define _CNENJ_CNIEJ1_MASK                       0x00000002
#define _CNENJ_CNIEJ1_LENGTH                     0x00000001

#define _CNENJ_CNIEJ2_POSITION                   0x00000002
#define _CNENJ_CNIEJ2_MASK                       0x00000004
#define _CNENJ_CNIEJ2_LENGTH                     0x00000001

#define _CNENJ_CNIEJ3_POSITION                   0x00000003
#define _CNENJ_CNIEJ3_MASK                       0x00000008
#define _CNENJ_CNIEJ3_LENGTH                     0x00000001

#define _CNENJ_CNIEJ4_POSITION                   0x00000004
#define _CNENJ_CNIEJ4_MASK                       0x00000010
#define _CNENJ_CNIEJ4_LENGTH                     0x00000001

#define _CNENJ_CNIEJ5_POSITION                   0x00000005
#define _CNENJ_CNIEJ5_MASK                       0x00000020
#define _CNENJ_CNIEJ5_LENGTH                     0x00000001

#define _CNENJ_CNIEJ6_POSITION                   0x00000006
#define _CNENJ_CNIEJ6_MASK                       0x00000040
#define _CNENJ_CNIEJ6_LENGTH                     0x00000001

#define _CNENJ_CNIEJ7_POSITION                   0x00000007
#define _CNENJ_CNIEJ7_MASK                       0x00000080
#define _CNENJ_CNIEJ7_LENGTH                     0x00000001

#define _CNENJ_CNIEJ8_POSITION                   0x00000008
#define _CNENJ_CNIEJ8_MASK                       0x00000100
#define _CNENJ_CNIEJ8_LENGTH                     0x00000001

#define _CNENJ_CNIEJ9_POSITION                   0x00000009
#define _CNENJ_CNIEJ9_MASK                       0x00000200
#define _CNENJ_CNIEJ9_LENGTH                     0x00000001

#define _CNENJ_CNIEJ10_POSITION                  0x0000000A
#define _CNENJ_CNIEJ10_MASK                      0x00000400
#define _CNENJ_CNIEJ10_LENGTH                    0x00000001

#define _CNENJ_CNIEJ11_POSITION                  0x0000000B
#define _CNENJ_CNIEJ11_MASK                      0x00000800
#define _CNENJ_CNIEJ11_LENGTH                    0x00000001

#define _CNENJ_CNIEJ12_POSITION                  0x0000000C
#define _CNENJ_CNIEJ12_MASK                      0x00001000
#define _CNENJ_CNIEJ12_LENGTH                    0x00000001

#define _CNENJ_CNIEJ13_POSITION                  0x0000000D
#define _CNENJ_CNIEJ13_MASK                      0x00002000
#define _CNENJ_CNIEJ13_LENGTH                    0x00000001

